Tps_0005/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.0005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    sampleUy
    {
        type            sets;
        libs ("libsampling.so");
        writeControl   timeStep;
        writeInterval  1;

        surfaceFormat    raw;
        fields           (U);
        setFormat        raw;
        sets
        (
            line1
            {
                type    uniform;
                axis    y;
                start   (0.05 0 -0.005);
                end     (0.05 0.1 -0.005);
                nPoints 25;
            }
        );
    }

    sampleUx
    {
        type            sets;
        libs ("libsampling.so");
        writeControl   timeStep;
        writeInterval  1;

        surfaceFormat    raw;
        fields           (U);
        setFormat        raw;
        sets
        (
            line1
            {
                type    uniform;
                axis    x;
                start   ( 0 0.05 -0.005);
                end     ( 0.1 0.05 -0.005);
                nPoints 25;
            }
        );
    }


}







// ************************************************************************* //
